//Дано натуральное число, выведите его последнюю цифру.
#include <iostream>
using namespace std;
int main() {
	int n; 
	n <= 10000;
	cin >> n;
	cout << n % 10;
	return 0;
}